app/views/messages/_message.html.erb

            <span class="content">
                <strong><%= message.user.profile.first_name.capitalize %>:</strong>
                <%= message.content %> <br />
                <small class="pull-left"><em>Created <%= time_ago_in_words(message.created_at) %> ago</em></small><br />
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "messages" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Testing Testing 1234"], ["user_id", 1], ["created_at", 2019-04-09 17:12:35 UTC], ["updated_at", 2019-04-09 17:12:35 UTC]]