app/views/comments/_comment.html.erb

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
            <span class="quiet"><small>Created: <%= time_ago_in_words(comment.created_at) %> ago
                                                by <%= comment.user.profile.first_name %></small></span>