app/views/users/show.html.erb

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---
    <div align="center" class="well profile-black-white">
       <h1><%= @user.profile.first_name %> <%= @user.profile.last_name %><br/></h1>

SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = ? ORDER BY "comments"."updated_at" DESC  [["user_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."user_id" = ?  [["user_id", 1]]
---
        <%= @user.profile.contact_email %><br/>
          <% if @user.comments.count > 0 %>