app/controllers/comments_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "Testing"], ["user_id", 1], ["created_at", 2019-04-09 10:31:32 UTC], ["updated_at", 2019-04-09 10:31:32 UTC]]
---
   def create
      @user = User.find(params[:user_id])
      @comment = @user.comments.build(comment_params)
      @comment.user = current_user
      if @comment.save