app/controllers/messages_controller.rb

INSERT INTO "messages" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Second Message"], ["user_id", 1], ["created_at", 2019-04-09 16:37:32 UTC], ["updated_at", 2019-04-09 16:37:32 UTC]]
---
    def create
       @message = Message.new(message_params)
       @message.user = current_user
       if @message.save