app/views/layouts/_navbar.html.erb

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---
      <ul class="nav navbar-nav navbar-left">
        <li><%= link_to  (current_user.profile.first_name) + ( current_user.profile.last_name) if user_signed_in? && current_user.profile %>